In [1]:
x=int(input("enter standard time"))
y=int(input("time taken"))
z=int(input("enter the rate"))

total=(z*y)+(50/100)*(x-y)*z
print(total)

enter standard time 5
time taken 8
enter the rate 8

52.0

In [6]:
import pandas as pd
df=pd.read_excel("panda.xlsx")

df

      Name   T   S   R
0  richard   7   6  23
1   adonis  26  26  18
2      bur   7   7  28
3     baby   8   6   2
4    sheen   7  10  28
5    shane  14  12  29
6     bane  25  30   1
7      joe  29   8   3
8       go  20  12  18

In [10]:
Q=int(input("enter number"))
x=df.loc[Q, "S"]
y=df.loc[Q, "T"]
z=df.loc[Q, "R"]
 
total=(z*y)+(50/100)*(x-y)*z
print(total)

enter number 5

377.0

In [14]:
import pandas as pd
df=pd.read_excel("panda2.xlsx")

df

      p  a  b  c    t  s
0  5000  5  8  6  420  2

In [18]:
U=df.loc[0, "p"]
S=df.loc[0,"a"]
B=df.loc[0, "b"]
C=df.loc[0, "c"]
P=df.loc[0, "t"]
O=df.loc[0,"s"]
X=S+B+C
h=((U*X)/P)/O
print(h)

113.0952380952381